app/controllers/departamentos_controller.rb

  def index
    @departamento = Departamento.new
    # @departamentos = Departamento.all
    @departamentos = Departamento.search(params[:value])
---
SELECT `departamentos`.* FROM `departamentos` WHERE (nombre LIKE '%%' OR interno LIKE '%%')