app/controllers/funcionarios_controller.rb

  def index
    @funcionario = Funcionario.new
    @funcionariosAll = Funcionario.all
---
SELECT `funcionarios`.* FROM `funcionarios` ORDER BY nombre ASC