app/controllers/home_controller.rb

SELECT `departamentos`.* FROM `departamentos` ORDER BY interno ASC
SELECT `funcionarios`.* FROM `funcionarios` ORDER BY updated_at desc LIMIT 1
---
	def index
		@departamentos = Departamento.all(:order => 'interno ASC')
		@funcionarios = Funcionario.all(:order => 'cumpleanio ASC')