app/views/funcionarios/_formulario.html.erb

			<%= f.input :cargo, :input_html => {class: "form-control"} %>
			<%= f.input :departamento_id, :collection => Departamento.all(:order => 'nombre'), :label_method => :nombre, :prompt => "Elige un departamento", :input_html => {class: "form-control"} %>
---
SELECT `departamentos`.* FROM `departamentos` ORDER BY interno